{
  "ticketId" : 23710540,
  "status" : "closed",
  "subject" : "Unrecoverable Account",
  "createDate" : 1476331525000,
  "comments" : [ {
    "author" : "BIG SQUEEZER",
    "comment" : "I am so distraught. This was my favorite account. To prove that this GENUINELY was my account I've attached an image of my student ID which includes my last name which is also part of the login INFO. I remember playing on this account a long time ago and I've recently really harcorely jumped back into league so I tried looking for my old smurfs. I was so upset that I found this account and then I discover it's banned. There is no way I had played on this account in the past few months. I checked on a 3rd party website if someone had used the account and it looks like someone had used it but they built the same items every game. Maybe a bot? I'm not sure. I am clearly asking for some sort of clarification on whether or not I could get the account back in any way which includes a total reset or something. Thank you for your time and have a great day Riot Support!\r\n\r\n\r\n\r\n<---> Ticket Summary <--->\r\nDo you have access to your signup email?: imzs7y@hotmail.com\r\nUsername: yes\r\nSummoner Name: cernigs\r\nRegion: xxxHotDILF69xxx\r\nDo you remember the account signup info?: north_america\r\nAccount creation date: yes\r\nDate of Birth on the account (if you added it): Months Ago\r\nLocation where account was registered (city and country): 05/12/1997\r\nPlease explain how you first gained access to this account: Merrick, New York\r\nOther people (friends/family members) who have ever had access to the account: I made it myself with no one in the room.\r\nDo you remember the store information?: None.\r\nWhat was your first ever RP purchase? (Include date and item): yes\r\nWhat did you use your refund tokens on?: I purchased some 10$/RP and ticketed about Snow Bunny Nidalee and submitted artwork for it!\r\nDo you remember the first 5 champions you have purchased?: Didn't use any tokens.\r\nFirst 5 champions you ever purchased:: yes\r\nFirst 3150 IP champion purchased: Veigar, Nidalee, Annie, Ashe, Warwick\r\nFirst 4800 IP champion purchased: none\r\nFirst 6300 IP champion purchased: none\r\nDid you receive or give gifts on this account?: none\r\nGifts received: no\r\nGifts given: \r\nHelp Center Stats: \r\nDescription:",
    "commentDate" : 1476331525000
  }, {
    "author" : "Agent",
    "comment" : "Hello there,\n\nWeeezing at your service on behalf of the Account team. Unfortunately, your account has been permanently suspended following the use of scripts, hacks, exploits or unauthorized third-party programs in League of Legends. Accounts that are caught using hacks to gain an unfair competitive advantage are subject to permanent suspension. We work hard to preserve a fair and competitive environment in League of Legends. Regardless of intent, use of unauthorized third-party programs is explicitly against the Terms of Use, which can be found here:\n\nNA: http://na.leagueoflegends.com/legal/termsofuse \n\nKeep in mind that account sharing of any kind is also against the Terms of Use. You are responsible for all activity on your account, so be sure to keep your account information to yourself.\n\nWe won't be able to go into the specifics of an account's exploit abuse, as divulging this information could compromise future investigations. Let me know if you have any other questions or concerns.\n\nWeeezing\nBilling and Account Support\n\"You are all free now!\"",
    "commentDate" : 1476832429000
  } ]
}