{
  "ticketId" : 35450561,
  "status" : "closed",
  "subject" : "Chat with boost me",
  "createDate" : 1530581493000,
  "comments" : [ {
    "author" : "System",
    "comment" : "Chat started: 2018-07-03 01:31 AM UTC\n\n(01:31:14 AM) boost me: Hey Riot Support!\n\nOn Saturday June 16th I played in a League of Legends Tournament at the Microsoft Store in Roosevelt Field Mall (ROG). My team and I won first place but I never received my reward (I think it was RP). I was informed it would be added to my account within 2 weeks but it's been longer than that. My smash.gg email used was: imzessed@gmail.com. I watched the TO put in the email properly and my username is the same on there as it is ingame. If there are any further details needed I'd be happy to supply them.\n\nThank you for your time and GL on the rift, \nJames\n(01:31:23 AM) *** Corndog joined the chat ***\n(01:31:31 AM) Corndog: Howdy!\n(01:31:39 AM) boost me: Greetings, Corndog!\n(01:31:47 AM) Corndog: Hi there :D\n(01:31:57 AM) Corndog: Sounds like you won in a tournament, grats on that!\n(01:32:06 AM) boost me: Thank you thank you :D\n(01:32:19 AM) Corndog: This situation would be something our Game team would help you out with\n(01:32:22 AM) Corndog: One sec and I can transfer you overf\n(01:32:24 AM) Corndog: over*\n(01:35:53 AM) *** Gunny joined the chat ***\n(01:36:43 AM) *** Corndog left the chat ***\n(01:37:07 AM) Gunny: Hey there!\n(01:37:11 AM) boost me: Hi Gunny!\n(01:37:49 AM) boost me: How's your night going?\n(01:40:16 AM) Gunny: Pretty good\n(01:40:19 AM) Gunny: What can I do for ya?\n(01:40:24 AM) Gunny: (sorry was a bit backed up)\n(01:40:36 AM) boost me: That's ok! should i copy paste my text from before\n(01:40:59 AM) Gunny: Nope, I can see it :)\n(01:41:09 AM) boost me: oh ok!\n(01:41:25 AM) Gunny: Alright, for this, I'll need the summoner names of your teammates and that's it :)\n(01:41:45 AM) boost me: Criddy BoyTimwunda Hockenswaq i think\n(01:41:59 AM) boost me: and Just The Trip ? i think\n(01:42:29 AM) boost me: and myself Boost Me\n(01:43:53 AM) Gunny: Hmm... I'm not seeing any record of you playing a tournament on June 16th\n(01:43:58 AM) Gunny: Are you sure you were using this account?\n(01:44:29 AM) boost me: Yes sir i watched the TO put my name in.\n(01:45:20 AM) boost me: He looked up my Smash.gg and selected the proper account and ticked off the rewarded thing under my name but i never got rewarded\n(01:46:27 AM) boost me: I definitely played though all of my teammates got the rewards except the player \"Criddy\" who also had to contact customer support\n(01:51:37 AM) Gunny: Hrmm. This investigation is going to take longer than we have time for here in Live Chat, and I can see that you have a ticket open regarding this.\n(01:51:46 AM) Gunny: So I'm going to pick that up and have you refer to it.\n(01:53:48 AM) boost me: Ok! thats fine!\n(01:54:16 AM) boost me: Thank you for your time and good luck with the busy evening.\n(01:54:22 AM) Gunny: Awesome, thanks for your understanding. It could take up to a day, cause I gotta wait on another party to reply :) \n\nYou have a good one!\n(01:54:44 AM) *** Gunny left the chat ***",
    "commentDate" : 1530582885000
  } ]
}