{
  "ticketId" : 34730926,
  "status" : "closed",
  "subject" : "Wintrading a Platinum II game",
  "createDate" : 1526351032000,
  "comments" : [ {
    "author" : "BIG SQUEEZER",
    "comment" : "My description of the wintrading that took place: The game starts and I try leashing red buff to yi but he DC's no big deal, nothing suspicious there. Suddenly Kai'si dies to azir, no big deal.\r\n\r\nGame continues and she buys first item mobility boots? Then resets her gold by killing warwick, which seems really suspicious. This continues for the rest of the game. Azir(Azir Kami) and Warwick(kadeem aIford) end up with the win kai'sa(Tilt is Friend) is the one that gave it to them. \r\n\r\nI can't believe this type of garbage happens in Platinum II elo, must either be a boost or some sort of wintrade. You can also easily tell this is a wintrade because they are all friends with each other based on their op.gg profiles. http://na.op.gg/summoner/userName=tiltisfriend\r\nhttp://na.op.gg/summoner/userName=kadeemaiford\r\nhttp://na.op.gg/summoner/userName=azirkami\r\n\r\nI've uploaded raw video evidence of these accounts wintrading in the recent ranked game I played.\r\n\r\nHave a good day and I look forward to some follow up.",
    "commentDate" : 1526351032000
  }, {
    "author" : "Agent",
    "comment" : "Hello boost me, \n\nWintrading can be a tough thing to investigate but you are right it is just boosting and it is still wrong. I'll personally look into these player's account to fully investigate this player. Due to our privacy policy, I will not be able to disclose any actions against another players account. This player's behavior is definitely out of hand and your report will give us valuable information for tracking players and escalating those players for proper investigation Thank you for bringing this to our attention and please continue using the report feature in game for negativity or directly to us if there is no way to report. I've included a link on our reporting system. \n\nhttps://support.riotgames.com/hc/en-us/articles/201752884\n\nIf you have any questions or concerns please feel free to reach out to us again.\n\nPeacemaker\nPB&G \nRiot games player support",
    "commentDate" : 1526402533000
  } ]
}